Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །དྲང་སྲོང་མཆོག་གིས་ཕྱག་བགྱིས་སྟོབས་བཅུ་ཡོན་ཏན་འཆང་།
en: “Supreme Rishi, you who hold the qualities of the ten strengths in your hands,

source: །སྲས་ཀྱི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་གྲོང་དུ་གཤེགས།
en: Encircled by the assembly of your sons, come to the city.

source: །སྣང་བྱེད་ཉི་མ་མུན་པའི་ཚོགས་སེལ་བཞེངས་སུ་གསོལ།
en: I pray that you, the illuminating sun who dispels darkness, will arise.

source: །བཅོམ་ལྡན་བདག་གི་སྡུམ་པར་བཤོས་གསོལ་གདུགས་ཚོད་བབ།
en: Bhagavān, the time has come for the midday meal in my garden. {xxv}

source: །སྲས་དང་ཐབས་ཅིག་བདག་གི་སྡུམ་པར་གཤེགས་སུ་གསོལ།
en: “I pray that you come, with your sons, to my garden.

source: །འགྲོ་བ་མང་པོའི་ཚོགས་ཀྱི་དོན་ཀྱང་བགྱིས་པར་འགྱུར།
en: You will benefit an assembly of many beings.

source: །ཇི་ལྟར་མར་མེ་མཛད་ཀྱིས་ཁྱོད་ལ་ལུང་བསྟན་པ།
en: Just as Dīpaṃkara granted a prophecy to you,

source: །དེ་བཞིན་བདག་ཀྱང་འཇིག་རྟེན་མངོན་སུམ་ལུང་སྟོན་ཅིག །བདག་འདིར་ལུང་བསྟན་འཇིག་རྟེན་ཐོས་ནས་ནི།
en: Grant me likewise a direct prophecy in this world. {xxvi} “When I have heard that prophecy in this world,

source: །སེམས་ཀྱང་མཆོག་ཏུ་རྒྱ་ཆེར་རབ་བསྐྱེད་དེ།
en: I will also develop a vast and perfect aspiration,

source: །འགྲོ་བ་འདི་དག་ཐམས་ཅད་སངས་རྒྱས་འགྱུར།
en: And all these beings will become buddhas.

source: །འདི་ན་སྣོད་མིན་སེམས་ཅན་གང་ཡང་མེད།
en: There are no unworthy beings present here. {xxvii}

source: །བཞེངས་ཤིག་བཞེངས་ཤིག་སྟོབས་བཅུ་མངའ་བའི་ལྷ།
en: “Arise, arise, Lord who has the ten strengths.

source: །བདག་ལ་རྗེས་སུ་ཕན་མཛོད་སྡུམ་པར་གཤེགས།
en: Benefit me and come to my garden.

source: །ཇི་ལྟར་བདག་གི་སྡུམ་པར་ཁྱོད་གཤེགས་པ།
en: Just as you come to my garden,

source: །དེ་བཞིན་བྱང་ཆུབ་ཤིང་དབང་དྲུང་བདག་མཆི།
en: In that way I will go to the supreme tree of enlightenment. {xxviii}

source: །བྱང་ཆུབ་ཤིང་དབང་དེ་དྲུང་བདག་མཆིས་ནས།
en: “When I have gone to the foot of the supreme tree of enlightenment,

source: །མི་གཡོ་མི་འགུལ་བར་ནི་གནས་བཅས་ཏེ།
en: I will remain there unshakable and unwavering.

source: །བྱམས་པས་སྡེར་བཅས་བདུད་རྣམས་ཕམ་བགྱིས་ནས།
en: I will defeat with love the māras and their claws,

source: །ཁྱོད་ཀྱིས་བརྙེས་བཞིན་བྱང་ཆུབ་ཐོབ་པར་བགྱི།
en: And just as you attained it, I, too, will attain enlightenment.” {xxix}

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་གསོལ་པ་མཁྱེན་ནས། །ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་ཚིགས་སུ་བཅད་པས་སླར་བཀའ་སྩལ་པ།
en: Then the Bhagavān, who had known what the youth Candraprabha would request, addressed these lines of verse to him:

source: ལོངས་ཤིག་ཟླ་འོད་རྒྱལ་བའི་སྲས།
en: “Arise Candraprabha, son of the jinas!

source: །ལོངས་ཤིག་སྦྱིན་དགའ་སེམས་ཅན་མཆོག །ལོངས་ཤིག་སྙིང་རྗེ་ཚུལ་ཁྲིམས་བརྟན།
en: Arise, you who are joyful in generosity, you supreme being! Arise, you who have compassion and firm conduct!

source: །བྲན་ལ་དེང་ནི་ཁྱིམ་དུ་འདོད།
en: Let us go to the meal! Let us proceed to your home.” {xxx}

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་གསུངས་ནས་སྔར་གདན་ལས་བཞེངས་ཏེ།
en: After speaking these lines, the Bhagavān arose from his seat.

source: ཤམ་ཐབས་གསོལ། ཆོས་གོས་དང་ལྷུང་བཟེད་བསྣམས་ནས་དགེ་སློང་འབུམ་དུ་ཚང་བའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤིན་ཏུ་མང་པོས་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: He put on his lower robe, picked up his Dharma robe and alms bowl, and with the great saṅgha of a hundred thousand bhikṣus, and accompanied by a multitude of bodhisattva mahāsattvas, he proceeded.

source: ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་དྲང་སྲོང་དང་ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེན་པོ་དང་གྲུལ་བུམ་དང་ཡི་དགས་དང་སྲུལ་པོ་དང་མི་དང་མི་མ་ཡིན་པ་བརྒྱ་སྟོང་དུ་མས་མཆོད་ཅིང་མངོན་པར་བསྟོད་ནས།
en: Many hundreds of thousands of devas, nāgas, yakṣas, gandharvas, asuras, rishis, garuḍas, kinnaras, mahoragas, kumbhāṇḍas, pretas, pūtanas, humans, and nonhumans made offerings to him and praised him.

source: སངས་རྒྱས་ཀྱི་མཐུ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་སངས་རྒྱས་ཀྱི་ཆོ་འཕྲུལ་ཆེན་པོ་དང་སངས་རྒྱས་ཀྱི་སྤྱོད་ལམ་གྱིས་འོད་ཟེར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་ནི་རབ་ཏུ་གཏོང་། སིལ་སྙན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ནི་རབ་ཏུ་དཀྲོལ། གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་ནི་མངོན་པར་སྒྲེང་།
en: Through his great buddha powers, his great buddha miracles, his great buddha manifestations, and his buddha conduct he radiated many quintillions of light rays.

source: གཟུགས་དང་ཁ་དོག་རགས་པ་དུ་མ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ངང་པ་དང་ཁྲུང་ཁྲུང་དང་ངུར་པ་དང་བཞད་དང་ཙ་ཀོ་ར་དང་རྨ་བྱ་དང་ཙ་ཤ་དང་རི་སྐེགས་དང་ཁུ་བྱུག་དང་ཀ་ལ་པིང་ཀ་དང་ཀུ་ནལ་ལ་སོགས་པ་བྱའི་ཁྱུ་མང་པོ་དུ་མ་སྒྲ་སྙན་ཅིང་འཇམ་ལ་ཡིད་དུ་འོང་བ་རྣམ་པ་དུ་མ་འབྱིན་པས་ནི་བར་སྣང་ལ་ལྷ་བཞིན་དུ་སོ་སོའི་ང་རོས་རོལ་མོའི་སྒྲ་དབྱངས་འབྱིན།
en: He emanated flocks of melodious, soft, and beautiful birds of many different shapes and colors, such as geese, cranes, ruddy shelducks, swans, partridges, peacocks, rollers, parrots, mynas, cuckoos, avadavats, and snipe, so that like devas in the sky, each with its own song, they emitted the sound of music.

source: ལྷའི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་བདུག་སྤོས་ཀྱི་སྣོད་ཡངས་ཤིང་ཆེ་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་ཐམས་ཅད་ཀྱང་བཻ་དཱུརྱ་དང་ཨན་ད་རྙིལ་དང་ཤེལ་དང་སྤུག་གི་ཡུ་བ་ཅན་དག་གནོད་སྦྱིན་གྱི་དབང་པོ་གཟུགས་བཟང་དང་དབང་པོའི་ཏོག་དང་རད་རོད་ཅན་དང་བ་ཀུ་ལ་དང་ལྔས་རྩེན་དང་ཤཱཀྱ་འཕེལ་ལ་སོགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་དག་གི་ལག་པ་གཉིས་ན་གཏུན་འཛིན་པ་བཞིན་དུ་ཐོགས་ཏེ། སྤོས་སྦྲུལ་གྱི་སྙིང་པོ་དང་གོ་ཥིར་ཥ་དང་མྲི་ཎ་ལ་དང་ཧ་རི་དང་མ་ལ་ཡ་དང་ཙན་དན་དམར་པོ་དང་ཨ་ག་རུ་ལ་སོགས་པས་བཀང་བའི་དུ་བ་ནི་འཐུལ།
en: The yakṣa lords Surūpa, Indraketu, Vikaṭa, Bakula, Pāñcika, Śākyavardhana, and many quintillions of yakṣa lords holding pestles with both hands, offered many quintillions of huge, vast censers made of various divine precious materials, with handles of beryl, sapphire, crystal, and white coral, filled with uragasāra sandalwood, gośīrṣa sandalwood, vetiver, yellow sandalwood, Malaya sandalwood, red sandalwood, agarwood, and so on, and from which smoke flowed.

source: ཕྱོགས་སོ་སོ་ནས་ལྷགས་པའི་རྒྱལ་པོ་དབང་ཆེ་བ། དབང་ཆེ་བར་གྲགས་པ་རྣམས་རྟ་དང་བ་ལང་རྒྱན་གྱིས་ཤིན་ཏུ་བརྒྱན་ཅིང་མ་ཞོན་པར་ཁྲིད་པའི་ཚོགས་དུ་མ་དང་ཤིང་རྟ་དང་དཔུང་བུ་ཆུང་གིས་ཡོངས་སུ་བསྐོར་ཅིང་ཕྲེང་བ་དང་ལྡ་ལྡི་མང་པོ་དང་རིན་པོ་ཆེའི་ཕྲེང་བ་ལག་ན་ཐོགས་ཤིང་སྔོན་ལོགས་ནས་རྐང་གིས་འགྲོའོ།
en: There were the superior kings of great power, renowned as having great power, from their own regions, accompanied by many divisions of perfectly adorned horses and elephants being led without their riders, chariots, and infantry, in lines marching in front, holding in their hands many streamers and precious garlands.

source: །རྟ་དང་གླང་པོ་ཆེ་ལེགས་པར་བརྒྱན་པ། མ་ཞོན་པར་ཁྲིད་པ་དག་ཀྱང་། རང་གི་སྟབས་ཀྱིས་མངོན་པར་འགྲོ་ཞིང་སྐད་ཡིད་དུ་འོང་ལ་སྙན་པ་འབྱིན་ཏོ།
en: The horses and elephants, even though they were being led along without riders, were proceeding magnificently and emitting beautiful cries.

source: །ཚངས་པ་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་གཡས་ཕྱོགས་ནས་མཆོད་པ་དང་རིམ་གྲོ་བསྙེན་བཀུར་བྱེད་ཅིང་འགྲོའོ། །གཡོན་ཕྱོགས་ནས་ནི་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལྷའི་བུ་དབང་ཆེ་བ། དབང་ཆེ་བར་གྲགས་པ། རྒྱ་ཆེ་ཞིང་རླབས་ཆེ་བ། བགྲང་བ་ལས་འདས་པ་རྣམས་ལྷའི་ཅོད་པན་བཟང་པོ་དང་གདུ་བུ་རྒྱན་ཅན་དང་རྣ་ཆ་དང་གདུ་བུ་དང་མེ་ཏོག་རྣ་རྒྱན་དང་རིན་པོ་ཆེའི་ཙོང་ཙོང་དང་མེ་ཏོག་གི་ཕྲེང་བས་ལུས་བརྒྱན་ཅིང་།
en: The Bhagavān was accompanied on his right-hand side by Brahmā, who was making offerings to him and attending upon him, and on his left-hand side by Śakra, lord of the devas, and by countless devas with great power, who were renowned for their great power, who were mighty and illustrious, and whose bodies were adorned by excellent divine crowns, ornamented anklets, earrings, bracelets, flowers on their ears, bejeweled necklaces, and flower garlands.

source: གཟུགས་མངོན་པར་སྣང་བས་ལྷའི་མེ་ཏོག་མན་དཱ་ར་དང་མདོག་མཛེས་དང་ཀོ་བི་དཱ་ར་དང་། སྠཱ་ལ་ཀ་དང་ཀུ་ར་བ་ཀ་དང་ཙམ་པ་ཀ་དང་དོང་ཀའི་མེ་ཏོག་དང་མྱ་ངན་འཚང་དང་སྐྱ་སྣར་དང་ཨ་ཏི་མུག་ཏ་ཀ་དང་ཨུད་པ་ལ་དང་བ་ཀུ་ལ་དང་མལ་ལི་ཀ་དང་ཀུན་ད་དང་ཀེ་ས་ར་དང་པད་མ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོ་དང་དྲི་མཆོག་དང་རིན་པོ་ཆེའི་ཕྲེང་བ་དང་རིན་པོ་ཆེའི་ཨ་ག་རུ་དང་ཤིང་རིན་པོ་ཆེའི་འབྲས་བུ་ཅན་དག་ལག་ན་ཐོགས་ཤིང་སིལ་སྙན་སྣ་ཚོགས་བརྒྱ་སྟོང་ནི་ཤིན་ཏུ་དཀྲོལ།
en: Their forms were made visible and they were holding coral tree flowers, asters, orchids, hibiscus, amaranths, magnolias, karnikara flowers, aśoka flowers, bignonias, kachnar flowers, blue lotuses, medlar flowers,sambac jasmine, star jasmine, ironwood flowers, red lotuses, night lotuses, white lotuses, water lilies, precious garlands, precious agarwood, and precious fruit.

source: གོས་བྱེ་བ་ནི་གཡོབ་ཅིང་ཨ་ལ་ལ་ཞེས་ག་ཞའི་སྒྲ་དག་ནི་འབྱིན།
en: They were playing hundreds of thousands of different kinds of musical instruments, waving millions of pieces of cloth, crying out, “Ha! Ha!

source: མེ་ཏོག་གི་ཆར་ཆེན་པོ་ནི་རབ་ཏུ་འབེབས་ཤིང་།
en: Ha!” and sending down a great rain of flowers.

source: བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་ནམ་མཁའི་ངོས་ཐམས་ཅད་བར་མཚམས་མེད་པར་གང་བར་འཁོད་དེ། མེ་ཏོག་དང་སྤོས་དང་ཕྲེང་བ་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་རིན་པོ་ཆེའི་ཆར་རབ་ཏུ་འབེབས་ཤིང་།
en: In order to make offerings to the Bhagavān they filled the entire sky without leaving any space and sent down a great rain of flowers, incense, garlands, perfumes, powders, and jewels.

source: བཅོམ་ལྡན་འདས་ཆུ་དྲོན་ཡོད་པའི་སྒོ་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་གདུགས་ཚོད་ལ་གཤེགས་སོ།
en: The Bhagavān entered at midday the great city of Rājagṛha through the hot springs gateway.

source: །དེའི་ཆོས་ཉིད་ནི་འདི་ཡིན་ཏེ། དེ་ལ་འདི་སྐད་ཅེས་བྱའོ།
en: The nature of this is described in these verses:

source: །སངས་རྒྱས་དེ་བཞིན་གཤེགས་པས་དུས་མཁྱེན་ནས།
en: The Tathāgata Buddha, knowing it was time,

source: །དཔའ་བོ་ཡོན་ཏན་ཀུན་གྱི་རབ་བརྒྱན་པ།
en: That hero adorned with all qualities,

source: །ཞིང་རྣམས་བསམ་གྱིས་མི་ཁྱབ་སྣང་མཛད་ཅིང་།
en: Who illuminates countless realms,

source: །བཅོམ་ལྡན་མི་ཡི་སེང་གེ་གཤེགས་པར་གྱུར།
en: The Bhagavān, the lion of men, set forth. {xxxi}

source: །སྤྱན་རས་གཟིགས་དང་མཐུ་ཆེན་དོན་ཡོད་དང་། །སྤོས་ཀྱི་བལ་གླང་རིན་ཆེན་ལག་བཟངས་དང་། །རིན་ཆེན་ཏོག་དང་འབྱུང་དཀའ་དཔའ་བོ་དང་། །དེ་དང་གཞན་དག་རྒྱལ་བའི་ཞབས་འབྲིང་བྱེད།
en: Avalokiteśvara, Mahā­sthāma­prāpta, and Amoghadarśin; Gandhahasti, Ratnakusuma, and Ratnabāhu; And Ratnaketu, Durabhisambhava, Vīrasena, And others followed in the Jina’s footsteps. {xxxii}

source: །གཡས་ཕྱོགས་ན་ནི་མི་ཕམ་འདུག་གྱུར་ཏེ། །དེ་མིང་བྱམས་པ་ཡོན་ཏན་མཐའ་ཡས་ཕྱུག །བར་དུ་མ་ཆོད་སངས་རྒྱས་འགྱུར་བ་སྟེ། །བསོད་ནམས་ཡེ་ཤེས་ཚོགས་ཀྱང་རབ་ཏུ་རྫོགས།
en: On his right was Ajita, who is named Maitraka, Who has the wealth of infinite qualities, Who will become the following buddha And has completed the accumulation of merit and wisdom. {xxxiii}

source: །བྱམས་དང་བཏང་སྙོམས་དགའ་བས་ལུས་བསྒོམས་ཤིང་།
en: He is one who has cultivated love, rejoicing, and equanimity.

source: །ཆོས་ཀྱི་བདག་ཉིད་ཆེན་པོ་སྙིང་རྗེས་སྐྱེད།
en: He is a great being of the Dharma who has developed compassion.

source: །ཡོན་ཏན་མཐའ་ཡས་ཐུབ་དབང་ཡོན་ཏན་སེམས།
en: He understands the infinite qualities, the qualities of the Lord of sages. {xxxiv}

source: །བདེ་གཤེགས་ཐུགས་རྗེ་ཅན་གྱི་ཞབས་འབྲིང་བྱེད།
en: He followed behind the compassionate Sugata

source: །དེ་ཡི་རྗེས་ལ་བསྐལ་པ་བཟང་པོ་ཡི།
en: And was followed by those who will be

source: །བློ་གྲོས་ཆེན་པོ་ལྡན་པ་ཇི་སྙེད་པའི།
en: Those with great realization in the Good Eon:

source: །སངས་རྒྱས་སྟོང་དུ་བཞིས་མ་ཚང་བ་དག །དེ་དག་གིས་ཀྱང་བྱམས་པ་མདུན་དུ་བདར།
en: The thousand buddhas less four, {xxxv} Who were preceded by Maitraka.

source: །གང་སྔོན་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་འདིར། །བསྐལ་པ་དག་ལ་རྒྱལ་བ་མཐའ་ཡས་མཆོད། །ཟླ་བ་མཛེས་པའི་འོད་འདྲ་ལྷ་ཡི་ལུས།
en: And also he who in the past, in this city of Rājagṛha, While born in divine bodies that were like beautiful moonlight, Made infinite offerings to jinas throughout eons, {xxxvi}

source: །ཟླ་འོད་དཔའ་བོ་ཡང་ནི་མདུན་ན་འདུག །སྙིང་རྗེ་མཆོག་གི་གཡོན་ཕྱོགས་འདུག་པ་ནི།
en: That hero Candraprabha was also present at the front. To the left of the one with supreme compassion

source: །འཇམ་དཔལ་བྱེ་བ་བརྒྱ་ཕྲག་མང་པོ་དང་། །དཔའ་བོ་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་མངོན་འཕགས་པ།
en: Was Mañjuśrī, along with many thousands of millions Of heroes who have sublime qualities of miraculous powers, {xxxvii}

source: །བརྒྱ་ཕྲག་མཐའ་ཡས་ཞིང་དུ་འགྲོ་བའོ།
en: Who traveled to endless hundreds of realms.

source: །དེ་ཡི་འོག་ཏུ་ཉན་ཐོས་དགེ་འདུན་ཏེ།
en: Following him were those in the śrāvaka saṅgha:

source: ཤཱ་རིའི་བུ་འོག་མཽད་གལ་ནག་པོ་དང་། །འོད་སྲུང་རབ་འབྱོར་དགའ་བོ་ཀ་ཕི་ན།
en: Śārisuta, Maudgalyāyana, Kāla, Kāśyapa, Subhūti, Nanda, and Kapphiṇa; {xxxviii}

source: །བཟང་ལྡན་རྒྱལ་པོ་དེ་བཞིན་ཀཽཎྜི་ནྱ།
en: Bhadrikarāja, and similarly Kauṇḍinya;

source: །ཀུན་དགའ་དེ་བཞིན་གནས་བརྟན་སྒྲ་གཅན་ཟིན།
en: Ānanda, and similarly Sthavira Rāhula;

source: །ལེགས་འོངས་ཀྲོན་ཙི་གང་པོ་འཆར་བ་པོ།
en: And Svāgata, Kañcika, Pūrṇa, Udāyin,

source: །ནམ་གྲུ་གསུས་ཆེན་ཉེ་འཁོར་མ་འགགས་པ།
en: Revata, Kauṣṭhila, Upāli, and Aniruddha. {xxxix}

source: །རལ་པ་ཅན་ནི་སྟོང་དུ་ཚང་བ་དག །ཉན་ཐོས་དགེ་འདུན་འོག་ཏུ་ཐམས་ཅད་ཀྱང་།
en: A full nine thousand of those with matted hair Followed behind the śrāvaka saṅgha.

source: །དཀའ་ཐུབ་དྲག་མཆོག་རིག་བྱེད་ཆོ་ག་ཤེས།
en: They were all mighty ascetics who knew the Vedas and the rituals,

source: །དམོད་པ་འདོར་དང་ཕན་འདོགས་ནུས་པ་ཡི།
en: And had mastered curses, renunciation, and beneficial incantations. {xl}

source: །དྲང་སྲོང་དུལ་བ་ཐལ་སྦྱར་འདུད་པ་བྱེད།
en: Self-controlled rishis with peaceful minds,

source: །ཞི་བའི་ཡིད་དང་དུལ་བའི་ཡིད་རྣམས་ཀྱིས།
en: With disciplined minds, bowing with palms together,

source: །སངས་རྒྱས་འཇིག་རྟེན་སྒྲོན་མ་མདུན་བདར་ཏེ།
en: Followed behind the Buddha, the lamp of the world,

source: །ཐུགས་རྗེར་ལྡན་པའི་མི་ཡི་སེང་གེ་གཤེགས།
en: The lion of men, endowed with compassion, {xli}

source: །སེམས་ཅན་སྟོང་རྣམས་རབ་ཏུ་ཐར་བར་མཛད།
en: The liberator of thousands of beings, as he proceeded.

source: །སྟོན་ཟླ་ཐ་ཆུངས་ཟླ་བ་ཉ་བ་ལྟར། །སྐར་ཚོགས་དབང་པོ་ཡོངས་སུ་དག་པ་བཞིན།
en: Like the completely pure lord of the host of stars, The full moon of the last month of autumn,

source: །ཚངས་པ་སྟོང་ཕྲག་དག་ནི་བརྒྱ་མང་གིས། །མཚུངས་པ་མེད་པའི་སྟོན་པ་ཡོངས་སུ་བསྐོར།
en: The Teacher who is without equal was encircled {xlii} By many hundred thousands of Brahmās.

source: །གྲོང་ཁྱེར་གྱི་ནི་སྒོ་སྟེངས་ཞབས་བཞག་ཚེ།
en: As he stepped on the threshold of the city’s gateway,

source: །ནགས་ཚལ་སྟུག་པོར་བཅས་པའི་ས་ཡང་གཡོས།
en: The earth and its thick forests shook.

source: །ལྷ་དང་ལྷ་མིན་ལྟོ་འཕྱེའི་ཚོགས་རྣམས་ཀྱང་།
en: The devas, asuras, and mahoragas {xliii}

source: །མེ་ཏོག་བཟང་པོ་དྲི་མཆོག་འཐོར་བར་བྱེད།
en: Scattered excellent flowers and supreme incense. {xliv}

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཡས་པ་འཁོར་ལོ་རིན་པོ་ཆེས་བརྒྱན་པ། །དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་བསགས་པ། །སྒོའི་ཐེམ་པ་ལ་བཞག་མ་ཐག་ཏུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས།
en: The moment the Bhagavān placed his right foot, adorned by a precious wheel from the accumulation of countless roots of merit, upon the threshold of the gate, this universe of a thousand million worlds shook in six ways.

source: རབ་ཏུ་གཡོས། ཀུན་ཏུ་རབ་ཏུ་གཡོས། འགུལ་རབ་ཏུ་འགུལ་ཀུན་ཏུ་རབ་ཏུ་འགུལ།
en: It trembled, trembled strongly, and trembled intensely;

source: །ཆེམ་ཆེམ་རབ་ཏུ་ཆེམ་ཆེམ་ཀུན་ཏུ་རབ་ཏུ་ཆེམ་ཆེམ།
en: it quaked, quaked strongly, and quaked intensely;

source: འུར་འུར་རབ་ཏུ་འུར་འུར་ཀུན་ཏུ་རབ་ཏུ་འུར་འུར་ཏེ། ཤར་ཕྱོགས་དམའ་ན་ནུབ་ཕྱོགས་མཐོ། ནུབ་ཕྱོགས་དམའ་ན་ཤར་ཕྱོགས་མཐོ། བྱང་ཕྱོགས་དམའ་ན་ལྷོ་ཕྱོགས་མཐོ། །ལྷོ་ཕྱོགས་དམའ་ན་བྱང་ཕྱོགས་མཐོ།
en: the east sank and the west rose, the west sank and the east rose, the north sank and the south rose, the south sank and the north rose, the perimeter sank and the center rose, and the center sank and the perimeter rose.

source: མཐའ་དམའ་ན་དབུས་མཐོ། དབུས་དམའ་ན་མཐའ་མཐོ་བར་གྱུར་ནས་འཇིག་རྟེན་དུ་སྣང་བ་ཆེན་པོ་ཡང་བྱུང་བར་གྱུར་ཏོ། །ངོ་མཚར་དང་རྨད་དུ་བྱུང་བའི་ཆོ་འཕྲུལ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་གཞན་དག་ཀྱང་སྣང་ངོ་།། །།འཕགས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོའི་མདོ། བམ་པོ་བཞི་པ།
en: A great radiance shone in the world, and countless, numberless other amazing, wonderful, miraculous manifestations appeared.

source: དེའི་ཆོས་ཉིད་ནི་འདི་ཡིན་ཏེ། དེ་ལ་འདི་སྐད་ཅེས་བྱའོ།
en: The nature of this is described in these verses:

source: །གྲོང་ཁྱེར་མཆོག་དེར་འདྲེན་པ་གཤེགས་པ་ན།
en: When the Guide came to that supreme city

source: །སྒོ་ཐེམ་ལ་ནི་ཞབས་མཆོག་བཞག་པའི་ཚེ།
en: And placed his supreme foot upon the gateway’s threshold,

source: །དེ་ཡི་དཔལ་གྱིས་ས་འདི་རབ་ཏུ་གཡོས།
en: That magnificence caused this earth to shake,

source: །གྲོང་ཁྱེར་མཆོག་འདིའི་སེམས་ཅན་རབ་ཏུ་དགའ།
en: And the beings in this supreme city were overjoyed. {1} When the Jina placed his foot on the gateway’s threshold

source: །མི་གང་བཀྲེས་ཤིང་སྐོམ་པར་གྱུར་པ་དག །དེ་ཚེ་དེ་དག་བཀྲེས་པ་མེད་པར་གྱུར། །རྒྱལ་བས་སྒོ་ཡི་ཐེམ་སྟེང་ཞབས་བཞག་ཚེ།
en: The people who were hungry and thirsty At that time became free of the need to eat or drink.

source: །བཀྲེས་ཤིང་སྐོམ་པ་དག་དང་བྲལ་བར་གྱུར།
en: They became free of hunger and thirst. {2}

source: །རྒྱལ་བས་སྒོ་ཡི་ཐེམ་སྟེང་ཞབས་བཞག་ཚེ།
en: When the Jina placed his foot on the gateway’s threshold

source: །དམུས་ལོང་གྱུར་པའི་མི་གང་ཅི་ཡོད་དང་། །རྣ་བས་མི་ཐོས་མགོན་མེད་བསོད་ནམས་ཆུང་།
en: All those people who were blind, Deaf, and had no protector and little merit

source: །དེ་དག་ཐམས་ཅད་མིག་དང་རྣ་བ་ཐོབ།
en: Were all able to see and hear. {3}

source: །གཤིན་རྗེའི་ཡུལ་གྱི་ཡི་དགས་གང་ཡོད་པ།
en: All the pretas in the realm of Yama,

source: །ཤིན་ཏུ་སྡུག་བསྔལ་ངར་སྣབས་མཆིལ་མ་ཟ།
en: Suffering greatly and eating snot and spit,

source: །ཐམས་ཅད་འོད་ཀྱིས་རེག་པས་བདེ་བར་གྱུར།
en: Were touched by light and became happy. {4}

source: །བྲག་གི་རྩེ་དང་རི་ཡི་རྩེ་མོ་དང་། །ཤིང་མཆོག་སཱ་ལ་དང་ནི་དོང་ཀ་རྣམས།
en: The supreme trees—the sal and the karnikara— At the summit of crags and on mountaintops,

source: །ཐམས་ཅད་སངས་རྒྱས་བཞུགས་པའི་ཕྱོགས་སུ་འདུད།
en: They all bowed toward the Buddha. {5}

source: །རྒྱ་མཚོ་མཐར་ཐུག་གྲོང་དང་གྲོང་ཁྱེར་རྣམས། །ས་ཀུན་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས།
en: The entire ground shook in six ways Throughout the villages and towns as far as the ocean,

source: །འདིར་ནི་གང་ལའང་གནོད་པར་གྱུར་པ་མེད།
en: Without causing harm to anyone. {6}

source: །ལྷ་དང་མི་དང་གྲུལ་བུམ་སྲིན་པོ་དང་། །སྐྱེས་བུ་གནས་པ་དགའ་མགུ་སེམས་རངས་ཏེ།
en: Devas, humans, kumbhāṇḍas, and rākṣasas— Wherever beings lived, there was happiness and joy.

source: བྱང་ཆུབ་དམ་པ་མཆོག་ལ་དད་བསྐྱེད་ནས།
en: They developed faith in supreme, sublime enlightenment

source: །འཇིག་རྟེན་རྣམ་པར་འདྲེན་པའི་གདུགས་ཀྱང་འཛིན།
en: And held a parasol for the guide of the world. {7}

source: །སིལ་སྙན་སྟོང་དག་མ་བརྡུངས་སྒྲ་འབྱིན་ཏེ།
en: Thousands of musical instruments sounded without being played;

source: །ཤིན་ཏུ་ཡིད་འོང་རོལ་མོའི་དབྱངས་ཐོས་པས།
en: Hearing the beautiful sound of music,

source: །དེ་ཚེ་སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་དགའ།
en: All beings were filled with joy. {8}

source: །སྡོང་པོ་སྟོང་ཕྲག་བརྒྱ་དག་འདུད་པར་གྱུར།
en: Hundreds of thousands of trees bowed down,

source: །དེ་ཚེ་མེ་ཏོག་ཀུན་ཀྱང་རབ་ཏུ་རྒྱས།
en: And all flowers blossomed at that time.

source: །བར་སྣང་ལས་ནི་ལྷ་རྣམས་བརྒྱ་སྟོང་དག །རྒྱལ་བ་ལ་ཡང་མི་མིན་མཆོད་པ་བྱེད།
en: Hundreds of thousands of devas in the sky Made nonhuman offerings to the Jina. {9}

source: །གླང་པོ་བརྒྱ་དག་སེམས་དགའ་སྒྲ་འབྱིན་ཏེ།
en: Hundreds of bulls lowed with joy.

source: །རྟ་དང་བ་ལང་རྒྱལ་པོ་ལུས་ཀྱང་སྟོད།
en: The kings of horses and elephants raised their bodies;

source: །རི་དགས་རྒྱལ་པོ་སེང་གེ་སྒྲ་འབྱིན་བྱེད།
en: The lions, the kings of animals, roared. {10}

source: །ས་དབང་རྒྱལ་པོ་གང་སུ་ཇི་སྙེད་ཅིག །ཕྱོགས་དང་ཕྱོགས་མཚམས་དག་ནས་ལྷགས་པ་རྣམས།
en: The kings, the rulers, however many there were, Came from the cardinal and intermediate directions.

source: །རྒྱལ་བའི་དཔལ་གཟི་དེ་འདྲ་མཐོང་ནས་ནི།
en: When they saw the glorious majesty of the Jina,

source: །རབ་ཏུ་སེམས་དགའ་ས་ལ་འདུག་ཅིང་འདུད།
en: With minds filled with joy they bowed to him. {11}

source: །ཁ་ཅིག་འཇིག་རྟེན་མགོན་ལ་མངོན་པར་སྟོད།
en: Some praised the Lord of the World;

source: །ཁ་ཅིག་རྒྱལ་ལ་མེ་ཏོག་ཆར་འབེབས་ཤིང་།
en: Some scattered a rain of flowers on the Jina;

source: །ཁ་ཅིག་སོར་བཅུ་ཐལ་མོ་སྦྱར་ནས་སུ།
en: Some placed their ten fingers together in homage,

source: །ཨེ་མ་རྒྱལ་བ་ཐུགས་རྗེ་ཅན་ཞེས་སྨྲ།
en: And they cried, “Oh, the Jina, compassionate one!” {12}

source: །ཁ་ཅིག་མུ་ཏིག་དོ་ཤལ་བཟང་པོ་དང་། །སྣ་ཚོགས་རྒྱན་མང་དགའ་སྐྱེད་འཐོར་བར་བྱེད།
en: Some scattered excellent strings of pearls And various ornaments that give rise to joy, And some scattered clothing and jewels.

source: །བྱང་ཆུབ་སེམས་མཆོག་དཔེ་མེད་བསྐྱེད་ནས་སུ།
en: They developed the supreme, unequaled aspiration to enlightenment. {13}

source: །ཁ་ཅིག་ན་བཟའ་རིན་ཆེན་འཐོར་བར་བྱེད། །ཁ་ཅིག་གསེར་གྱི་དྲ་བ་བཟང་པོ་འཐོར།
en: Some scattered excellent meshes of gold;

source: །ཁ་ཅིག་སྤེན་ཏོག་རྒྱན་བཟང་འཐོར་བར་བྱེད།
en: Some also scattered mukhaphullaka adornments.

source: །ལ་ལ་གསེར་གྱི་རྒྱན་ནི་དམ་པ་འཐོར།
en: Some scattered excellent ornaments of gold,

source: །ཁ་ཅིག་དེ་བཞིན་གདུ་བུ་འཐོར་བར་བྱེད།
en: And some, likewise, scattered anklets. {14}

source: །ལ་ལ་གདུ་བུ་བཟང་པོ་དེ་འཐོར་ཏེ།
en: Some scattered excellent bracelets,

source: །ཁ་ཅིག་རིན་ཆེན་སྤྲས་པའི་དཔུང་རྒྱན་འཐོར།
en: Some scattered armlets inset with jewels,

source: །ཁ་ཅིག་བདག་ཅག་སངས་རྒྱས་གྱུར་ཅིག་ཅེས། །སེམས་བསྐྱེད་གོས་ཕྲན་བཟང་པོ་འཐོར་བར་བྱེད།
en: And some aspired to enlightenment, scattering excellent Pieces of cloth, saying, “May we become buddhas!” {15}

source: །འཇིག་རྟེན་མགོན་པོ་སྒོ་ན་བཞུགས་པའི་ཚེ།
en: When the Lord of the World stood in the gateway,

source: །མི་དག་ཁ་ཅིག་གསེར་གྱི་ཙོང་ཙོང་འཐོར།
en: Some people scattered golden necklaces.

source: །སེམས་དད་གཙུག་གི་ནོར་བུ་མཆོག་ཀྱང་འཐོར།
en: Some with minds filled with faith scattered excellent crest jewels;

source: །ལ་ལ་རིན་ཆེན་དྲ་བ་འཐོར་བར་བྱེད།
en: Some scattered networks of jewels. {16}

source: །སེམས་ཅན་ཤིན་ཏུ་མི་བཟད་སྡུག་བསྔལ་ཞིང་།
en: Those beings who were in extreme suffering,

source: །གཙེ་བ་རྣམ་མང་ཟུག་རྔུས་ཟུག་པ་ཡང་།
en: Tormented by many kinds of miseries,

source: །འདྲེན་པ་སྐྱེས་བུ་གཙོ་བོའི་དཔལ་གྱིས་ནི། །ཐམས་ཅད་བདེ་བ་དང་ཡང་ལྡན་པར་གྱུར།
en: All attained happiness through the majesty Of the Guide, the supreme human. {17}

source: །ཁུ་བྱུག་དང་ནི་རི་སྐེགས་རྨ་བྱ་དང་། །དེ་བཞིན་ཁྲུང་ཁྲུང་དང་ནི་མཚོ་བྱ་དང་། །བྱ་མང་ཀུན་ནི་ནམ་མཁར་འདུག་ནས་སུ། །ཤིན་ཏུ་ཡིད་འོང་མཆོག་གི་སྒྲ་ཡང་འབྱིན། །དེ་ཚེ་བྱ་ཚོགས་མང་པོ་རབ་དགའ་བས། །འཇམ་ཞིང་ཡིད་དུ་འོང་བའི་སྒྲ་ཕྱུང་སྟེ། །གང་གིས་སྙན་པའི་སྒྲ་སྐད་དེ་ཐོས་པ།
en: Cuckoos, mynas, and peacocks, And similarly cranes and other water birds— All the flocks of birds were in the sky Emitting their beautiful, perfect songs. {18}

source: །དེ་དག་འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་ཞི། །སེམས་ཅན་བྱེ་བས་དགའ་བའི་སྒྲ་ཐོས་ནས།
en: Desire, anger, and ignorance Ceased in whoever heard The sweet, beautiful songs Of those flocks of joyous birds. {19} The millions of beings who heard that joyful sound

source: །ཐམས་ཅད་རྗེས་སུ་འཐུན་པའི་བཟོད་ཐོབ་སྟེ།
en: All attained the patience that is concordant with the Dharma. The Sugata gave them all this prophecy:

source: །མ་འོངས་དུས་ན་རྒྱལ་བར་ཁྱེད་འགྱུར་ཞེས། །དེ་དག་ཀུན་ལ་བདེ་གཤེགས་ལུང་ཡང་སྟོན།
en: “You will in the future become buddhas.” {20}

source: །དེ་ཡི་དུས་ན་ཉོན་མོངས་མི་འབྱུང་སྟེ།
en: At that time the kleśas did not arise,

source: །ཆོས་ཀྱི་རྒྱལ་ལ་ཐམས་ཅད་རི་མོར་བཅས།
en: And everyone was respectful to the Dharma king. {21}

source: །དེ་ཚེ་འདྲེན་པའི་སྐུ་བྱད་མཐོང་ནས་ནི།
en: At that time, when they saw the form of the Guide’s body,

source: །སངས་རྒྱས་ཡེ་ཤེས་མཆོག་ལ་མོས་བསྐྱེད་དེ།
en: They developed the aspiration for the supreme wisdom of buddhahood.

source: །བདག་ཅག་ནམ་ཞིག་འདི་འདྲའི་མཁྱེན་ཐོབ་སྙམ།
en: They wondered, “When will we attain this kind of wisdom?”

source: །བསམ་པ་མཁྱེན་ནས་རྒྱལ་བ་ལུང་སྟོན་ཏེ།
en: And the Jina, knowing that, gave them their prophecies. {22}

source: །བདེ་བར་གཤེགས་པའི་བ་སྤུ་ཁུང་རེ་ནས།
en: From each pore of the Sugata

source: །འོད་ཟེར་དག་ནི་སྟོང་ཕྲག་བརྒྱ་ཡང་བྱུང་།
en: There shone hundreds of thousands of light rays

source: །དེ་ལས་ལྷག་པར་གང་གཱའི་བྱེ་སྙེད་དེ།
en: And more, as many as there are sand grains in the Ganges—

source: །དེ་དག་གི་ཡང་མཚན་མ་གཟུང་མི་ནུས།
en: It would not be possible to perceive all their attributes. {23}

source: །དེ་ཚེ་ཉི་མའི་འོད་ཀྱང་མི་སྣང་སྟེ།
en: At that time, the sunlight did not shine.

source: །མེ་དང་ནོར་བུ་ལྷ་ཀུན་འོད་ཀྱང་མེད། །རྒྱལ་བ་གྲོང་གཤེགས་སངས་རྒྱས་རྣམ་མཛེས་པ།
en: Nor was there light from jewels, fire, or the devas.
